---
type: RebarShapeConstraintFixedSegmentDir
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarShapeConstraintFixedSegmentDir

`Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintFixedSegmentDir | 2012 | `public RebarShapeConstraintFixedSegmentDir ( UV dir )` |
| Property | Direction | 2012 | `public UV Direction { get ; set ; }` |